RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_pdm.h
/***************************************************************************//**
 * @file
 * @brief EFM32GG12B_PDM register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif


#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/
/***************************************************************************//**
 * @defgroup EFM32GG12B_PDM PDM
 * @{
 * @brief EFM32GG12B_PDM Register Declaration
 ******************************************************************************/
/** PDM Register Declaration */
typedef struct {
  __IM uint32_t  IPVERSION;     /**< IP Version ID  */
  __IOM uint32_t EN;            /**< PDM Module enable Register  */
  __IOM uint32_t CTRL;          /**< PDM Core Control Register  */
  __IOM uint32_t CMD;           /**< PDM Core Command Register  */
  __IM uint32_t  STATUS;        /**< PDM Status register  */
  __IOM uint32_t CFG0;          /**< PDM Core Configuration Register0  */
  __IOM uint32_t CFG1;          /**< PDM Core Configuration Register1  */
  uint32_t       RESERVED0[1U]; /**< Reserved for future use **/
  __IM uint32_t  RXDATA;        /**< PDM Received Data Register  */
  uint32_t       RESERVED1[7U]; /**< Reserved for future use **/
  __IM uint32_t  IF;            /**< Interrupt Flag Register  */
  __IOM uint32_t IFS;           /**< Interrupt Flag Set Register  */
  __IOM uint32_t IFC;           /**< Interrupt Flag Clear Register  */
  __IOM uint32_t IEN;           /**< Interrupt Enable Register  */
  __IOM uint32_t ROUTEPEN;      /**< I/O LOCATION Enable Register  */
  __IOM uint32_t ROUTELOC0;     /**< I/O LOCATION Register   */
  __IOM uint32_t ROUTELOC1;     /**< I/O LOCATION Register   */
  uint32_t       RESERVED2[1U]; /**< Reserved for future use **/
  __IM uint32_t  SYNCBUSY;      /**< Synchronization Busy Register   */
} PDM_TypeDef;                  /** @} */

/***************************************************************************//**
 * @addtogroup EFM32GG12B_PDM
 * @{
 * @defgroup EFM32GG12B_PDM_BitFields  PDM Bit Fields
 * @{
 ******************************************************************************/

/* Bit fields for PDM IPVERSION */
#define _PDM_IPVERSION_RESETVALUE              0x00000000UL                            /**< Default value for PDM_IPVERSION */
#define _PDM_IPVERSION_MASK                    0xFFFFFFFFUL                            /**< Mask for PDM_IPVERSION */
#define _PDM_IPVERSION_IPVERSION_SHIFT         0                                       /**< Shift value for PDM_IPVERSION */
#define _PDM_IPVERSION_IPVERSION_MASK          0xFFFFFFFFUL                            /**< Bit mask for PDM_IPVERSION */
#define _PDM_IPVERSION_IPVERSION_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for PDM_IPVERSION */
#define PDM_IPVERSION_IPVERSION_DEFAULT        (_PDM_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for PDM_IPVERSION */

/* Bit fields for PDM EN */
#define _PDM_EN_RESETVALUE                     0x00000000UL              /**< Default value for PDM_EN */
#define _PDM_EN_MASK                           0x00000001UL              /**< Mask for PDM_EN */
#define PDM_EN_EN                              (0x1UL << 0)              /**< Module enable */
#define _PDM_EN_EN_SHIFT                       0                         /**< Shift value for PDM_EN */
#define _PDM_EN_EN_MASK                        0x1UL                     /**< Bit mask for PDM_EN */
#define _PDM_EN_EN_DEFAULT                     0x00000000UL              /**< Mode DEFAULT for PDM_EN */
#define _PDM_EN_EN_DISABLE                     0x00000000UL              /**< Mode DISABLE for PDM_EN */
#define _PDM_EN_EN_ENABLE                      0x00000001UL              /**< Mode ENABLE for PDM_EN */
#define PDM_EN_EN_DEFAULT                      (_PDM_EN_EN_DEFAULT << 0) /**< Shifted mode DEFAULT for PDM_EN */
#define PDM_EN_EN_DISABLE                      (_PDM_EN_EN_DISABLE << 0) /**< Shifted mode DISABLE for PDM_EN */
#define PDM_EN_EN_ENABLE                       (_PDM_EN_EN_ENABLE << 0)  /**< Shifted mode ENABLE for PDM_EN */

/* Bit fields for PDM CTRL */
#define _PDM_CTRL_RESETVALUE                   0x00000000UL                       /**< Default value for PDM_CTRL */
#define _PDM_CTRL_MASK                         0x800FFF1FUL                       /**< Mask for PDM_CTRL */
#define _PDM_CTRL_GAIN_SHIFT                   0                                  /**< Shift value for PDM_GAIN */
#define _PDM_CTRL_GAIN_MASK                    0x1FUL                             /**< Bit mask for PDM_GAIN */
#define _PDM_CTRL_GAIN_DEFAULT                 0x00000000UL                       /**< Mode DEFAULT for PDM_CTRL */
#define PDM_CTRL_GAIN_DEFAULT                  (_PDM_CTRL_GAIN_DEFAULT << 0)      /**< Shifted mode DEFAULT for PDM_CTRL */
#define _PDM_CTRL_DSR_SHIFT                    8                                  /**< Shift value for PDM_DSR */
#define _PDM_CTRL_DSR_MASK                     0xFFF00UL                          /**< Bit mask for PDM_DSR */
#define _PDM_CTRL_DSR_DEFAULT                  0x00000000UL                       /**< Mode DEFAULT for PDM_CTRL */
#define PDM_CTRL_DSR_DEFAULT                   (_PDM_CTRL_DSR_DEFAULT << 8)       /**< Shifted mode DEFAULT for PDM_CTRL */
#define PDM_CTRL_OUTCLKEN                      (0x1UL << 31)                      /**< PDM Clock enable */
#define _PDM_CTRL_OUTCLKEN_SHIFT               31                                 /**< Shift value for PDM_OUTCLKEN */
#define _PDM_CTRL_OUTCLKEN_MASK                0x80000000UL                       /**< Bit mask for PDM_OUTCLKEN */
#define _PDM_CTRL_OUTCLKEN_DEFAULT             0x00000000UL                       /**< Mode DEFAULT for PDM_CTRL */
#define PDM_CTRL_OUTCLKEN_DEFAULT              (_PDM_CTRL_OUTCLKEN_DEFAULT << 31) /**< Shifted mode DEFAULT for PDM_CTRL */

/* Bit fields for PDM CMD */
#define _PDM_CMD_RESETVALUE                    0x00000000UL                    /**< Default value for PDM_CMD */
#define _PDM_CMD_MASK                          0x00010111UL                    /**< Mask for PDM_CMD */
#define PDM_CMD_START                          (0x1UL << 0)                    /**< Start DCF */
#define _PDM_CMD_START_SHIFT                   0                               /**< Shift value for PDM_START */
#define _PDM_CMD_START_MASK                    0x1UL                           /**< Bit mask for PDM_START */
#define _PDM_CMD_START_DEFAULT                 0x00000000UL                    /**< Mode DEFAULT for PDM_CMD */
#define PDM_CMD_START_DEFAULT                  (_PDM_CMD_START_DEFAULT << 0)   /**< Shifted mode DEFAULT for PDM_CMD */
#define PDM_CMD_STOP                           (0x1UL << 4)                    /**< Stop DCF */
#define _PDM_CMD_STOP_SHIFT                    4                               /**< Shift value for PDM_STOP */
#define _PDM_CMD_STOP_MASK                     0x10UL                          /**< Bit mask for PDM_STOP */
#define _PDM_CMD_STOP_DEFAULT                  0x00000000UL                    /**< Mode DEFAULT for PDM_CMD */
#define PDM_CMD_STOP_DEFAULT                   (_PDM_CMD_STOP_DEFAULT << 4)    /**< Shifted mode DEFAULT for PDM_CMD */
#define PDM_CMD_CLEAR                          (0x1UL << 8)                    /**< Clear DCF */
#define _PDM_CMD_CLEAR_SHIFT                   8                               /**< Shift value for PDM_CLEAR */
#define _PDM_CMD_CLEAR_MASK                    0x100UL                         /**< Bit mask for PDM_CLEAR */
#define _PDM_CMD_CLEAR_DEFAULT                 0x00000000UL                    /**< Mode DEFAULT for PDM_CMD */
#define PDM_CMD_CLEAR_DEFAULT                  (_PDM_CMD_CLEAR_DEFAULT << 8)   /**< Shifted mode DEFAULT for PDM_CMD */
#define PDM_CMD_FIFOFL                         (0x1UL << 16)                   /**< FIFO Flush */
#define _PDM_CMD_FIFOFL_SHIFT                  16                              /**< Shift value for PDM_FIFOFL */
#define _PDM_CMD_FIFOFL_MASK                   0x10000UL                       /**< Bit mask for PDM_FIFOFL */
#define _PDM_CMD_FIFOFL_DEFAULT                0x00000000UL                    /**< Mode DEFAULT for PDM_CMD */
#define PDM_CMD_FIFOFL_DEFAULT                 (_PDM_CMD_FIFOFL_DEFAULT << 16) /**< Shifted mode DEFAULT for PDM_CMD */

/* Bit fields for PDM STATUS */
#define _PDM_STATUS_RESETVALUE                 0x00000020UL                       /**< Default value for PDM_STATUS */
#define _PDM_STATUS_MASK                       0x00000731UL                       /**< Mask for PDM_STATUS */
#define PDM_STATUS_ACT                         (0x1UL << 0)                       /**< PDM is active */
#define _PDM_STATUS_ACT_SHIFT                  0                                  /**< Shift value for PDM_ACT */
#define _PDM_STATUS_ACT_MASK                   0x1UL                              /**< Bit mask for PDM_ACT */
#define _PDM_STATUS_ACT_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for PDM_STATUS */
#define PDM_STATUS_ACT_DEFAULT                 (_PDM_STATUS_ACT_DEFAULT << 0)     /**< Shifted mode DEFAULT for PDM_STATUS */
#define PDM_STATUS_FULL                        (0x1UL << 4)                       /**< FIFO FULL Status */
#define _PDM_STATUS_FULL_SHIFT                 4                                  /**< Shift value for PDM_FULL */
#define _PDM_STATUS_FULL_MASK                  0x10UL                             /**< Bit mask for PDM_FULL */
#define _PDM_STATUS_FULL_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for PDM_STATUS */
#define PDM_STATUS_FULL_DEFAULT                (_PDM_STATUS_FULL_DEFAULT << 4)    /**< Shifted mode DEFAULT for PDM_STATUS */
#define PDM_STATUS_EMPTY                       (0x1UL << 5)                       /**< FIFO EMPTY Status */
#define _PDM_STATUS_EMPTY_SHIFT                5                                  /**< Shift value for PDM_EMPTY */
#define _PDM_STATUS_EMPTY_MASK                 0x20UL                             /**< Bit mask for PDM_EMPTY */
#define _PDM_STATUS_EMPTY_DEFAULT              0x00000001UL                       /**< Mode DEFAULT for PDM_STATUS */
#define PDM_STATUS_EMPTY_DEFAULT               (_PDM_STATUS_EMPTY_DEFAULT << 5)   /**< Shifted mode DEFAULT for PDM_STATUS */
#define _PDM_STATUS_FIFOCNT_SHIFT              8                                  /**< Shift value for PDM_FIFOCNT */
#define _PDM_STATUS_FIFOCNT_MASK               0x700UL                            /**< Bit mask for PDM_FIFOCNT */
#define _PDM_STATUS_FIFOCNT_DEFAULT            0x00000000UL                       /**< Mode DEFAULT for PDM_STATUS */
#define PDM_STATUS_FIFOCNT_DEFAULT             (_PDM_STATUS_FIFOCNT_DEFAULT << 8) /**< Shifted mode DEFAULT for PDM_STATUS */

