RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_pdm.h
/* Bit fields for PDM CFG0 */
#define _PDM_CFG0_RESETVALUE                   0x00000000UL                                /**< Default value for PDM_CFG0 */
#define _PDM_CFG0_MASK                         0x0F033733UL                                /**< Mask for PDM_CFG0 */
#define _PDM_CFG0_FORDER_SHIFT                 0                                           /**< Shift value for PDM_FORDER */
#define _PDM_CFG0_FORDER_MASK                  0x3UL                                       /**< Bit mask for PDM_FORDER */
#define _PDM_CFG0_FORDER_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for PDM_CFG0 */
#define _PDM_CFG0_FORDER_SECOND                0x00000000UL                                /**< Mode SECOND for PDM_CFG0 */
#define _PDM_CFG0_FORDER_THIRD                 0x00000001UL                                /**< Mode THIRD for PDM_CFG0 */
#define _PDM_CFG0_FORDER_FOURTH                0x00000002UL                                /**< Mode FOURTH for PDM_CFG0 */
#define _PDM_CFG0_FORDER_FIFTH                 0x00000003UL                                /**< Mode FIFTH for PDM_CFG0 */
#define PDM_CFG0_FORDER_DEFAULT                (_PDM_CFG0_FORDER_DEFAULT << 0)             /**< Shifted mode DEFAULT for PDM_CFG0 */
#define PDM_CFG0_FORDER_SECOND                 (_PDM_CFG0_FORDER_SECOND << 0)              /**< Shifted mode SECOND for PDM_CFG0 */
#define PDM_CFG0_FORDER_THIRD                  (_PDM_CFG0_FORDER_THIRD << 0)               /**< Shifted mode THIRD for PDM_CFG0 */
#define PDM_CFG0_FORDER_FOURTH                 (_PDM_CFG0_FORDER_FOURTH << 0)              /**< Shifted mode FOURTH for PDM_CFG0 */
#define PDM_CFG0_FORDER_FIFTH                  (_PDM_CFG0_FORDER_FIFTH << 0)               /**< Shifted mode FIFTH for PDM_CFG0 */
#define _PDM_CFG0_NUMCH_SHIFT                  4                                           /**< Shift value for PDM_NUMCH */
#define _PDM_CFG0_NUMCH_MASK                   0x30UL                                      /**< Bit mask for PDM_NUMCH */
#define _PDM_CFG0_NUMCH_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for PDM_CFG0 */
#define _PDM_CFG0_NUMCH_ONE                    0x00000000UL                                /**< Mode ONE for PDM_CFG0 */
#define _PDM_CFG0_NUMCH_TWO                    0x00000001UL                                /**< Mode TWO for PDM_CFG0 */
#define _PDM_CFG0_NUMCH_THREE                  0x00000002UL                                /**< Mode THREE for PDM_CFG0 */
#define _PDM_CFG0_NUMCH_FOUR                   0x00000003UL                                /**< Mode FOUR for PDM_CFG0 */
#define PDM_CFG0_NUMCH_DEFAULT                 (_PDM_CFG0_NUMCH_DEFAULT << 4)              /**< Shifted mode DEFAULT for PDM_CFG0 */
#define PDM_CFG0_NUMCH_ONE                     (_PDM_CFG0_NUMCH_ONE << 4)                  /**< Shifted mode ONE for PDM_CFG0 */
#define PDM_CFG0_NUMCH_TWO                     (_PDM_CFG0_NUMCH_TWO << 4)                  /**< Shifted mode TWO for PDM_CFG0 */
#define PDM_CFG0_NUMCH_THREE                   (_PDM_CFG0_NUMCH_THREE << 4)                /**< Shifted mode THREE for PDM_CFG0 */
#define PDM_CFG0_NUMCH_FOUR                    (_PDM_CFG0_NUMCH_FOUR << 4)                 /**< Shifted mode FOUR for PDM_CFG0 */
#define _PDM_CFG0_DATAFORMAT_SHIFT             8                                           /**< Shift value for PDM_DATAFORMAT */
#define _PDM_CFG0_DATAFORMAT_MASK              0x700UL                                     /**< Bit mask for PDM_DATAFORMAT */
#define _PDM_CFG0_DATAFORMAT_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for PDM_CFG0 */
#define _PDM_CFG0_DATAFORMAT_RIGHT16           0x00000000UL                                /**< Mode RIGHT16 for PDM_CFG0 */
#define _PDM_CFG0_DATAFORMAT_DOUBLE16          0x00000001UL                                /**< Mode DOUBLE16 for PDM_CFG0 */
#define _PDM_CFG0_DATAFORMAT_RIGHT24           0x00000002UL                                /**< Mode RIGHT24 for PDM_CFG0 */
#define _PDM_CFG0_DATAFORMAT_FULL32BIT         0x00000003UL                                /**< Mode FULL32BIT for PDM_CFG0 */
#define _PDM_CFG0_DATAFORMAT_LEFT16            0x00000004UL                                /**< Mode LEFT16 for PDM_CFG0 */
#define _PDM_CFG0_DATAFORMAT_LEFT24            0x00000005UL                                /**< Mode LEFT24 for PDM_CFG0 */
#define _PDM_CFG0_DATAFORMAT_RAW32BIT          0x00000006UL                                /**< Mode RAW32BIT for PDM_CFG0 */
#define PDM_CFG0_DATAFORMAT_DEFAULT            (_PDM_CFG0_DATAFORMAT_DEFAULT << 8)         /**< Shifted mode DEFAULT for PDM_CFG0 */
#define PDM_CFG0_DATAFORMAT_RIGHT16            (_PDM_CFG0_DATAFORMAT_RIGHT16 << 8)         /**< Shifted mode RIGHT16 for PDM_CFG0 */
#define PDM_CFG0_DATAFORMAT_DOUBLE16           (_PDM_CFG0_DATAFORMAT_DOUBLE16 << 8)        /**< Shifted mode DOUBLE16 for PDM_CFG0 */
#define PDM_CFG0_DATAFORMAT_RIGHT24            (_PDM_CFG0_DATAFORMAT_RIGHT24 << 8)         /**< Shifted mode RIGHT24 for PDM_CFG0 */
#define PDM_CFG0_DATAFORMAT_FULL32BIT          (_PDM_CFG0_DATAFORMAT_FULL32BIT << 8)       /**< Shifted mode FULL32BIT for PDM_CFG0 */
#define PDM_CFG0_DATAFORMAT_LEFT16             (_PDM_CFG0_DATAFORMAT_LEFT16 << 8)          /**< Shifted mode LEFT16 for PDM_CFG0 */
#define PDM_CFG0_DATAFORMAT_LEFT24             (_PDM_CFG0_DATAFORMAT_LEFT24 << 8)          /**< Shifted mode LEFT24 for PDM_CFG0 */
#define PDM_CFG0_DATAFORMAT_RAW32BIT           (_PDM_CFG0_DATAFORMAT_RAW32BIT << 8)        /**< Shifted mode RAW32BIT for PDM_CFG0 */
#define _PDM_CFG0_FIFODVL_SHIFT                12                                          /**< Shift value for PDM_FIFODVL */
#define _PDM_CFG0_FIFODVL_MASK                 0x3000UL                                    /**< Bit mask for PDM_FIFODVL */
#define _PDM_CFG0_FIFODVL_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for PDM_CFG0 */
#define _PDM_CFG0_FIFODVL_ONE                  0x00000000UL                                /**< Mode ONE for PDM_CFG0 */
#define _PDM_CFG0_FIFODVL_TWO                  0x00000001UL                                /**< Mode TWO for PDM_CFG0 */
#define _PDM_CFG0_FIFODVL_THREE                0x00000002UL                                /**< Mode THREE for PDM_CFG0 */
#define _PDM_CFG0_FIFODVL_FOUR                 0x00000003UL                                /**< Mode FOUR for PDM_CFG0 */
#define PDM_CFG0_FIFODVL_DEFAULT               (_PDM_CFG0_FIFODVL_DEFAULT << 12)           /**< Shifted mode DEFAULT for PDM_CFG0 */
#define PDM_CFG0_FIFODVL_ONE                   (_PDM_CFG0_FIFODVL_ONE << 12)               /**< Shifted mode ONE for PDM_CFG0 */
#define PDM_CFG0_FIFODVL_TWO                   (_PDM_CFG0_FIFODVL_TWO << 12)               /**< Shifted mode TWO for PDM_CFG0 */
#define PDM_CFG0_FIFODVL_THREE                 (_PDM_CFG0_FIFODVL_THREE << 12)             /**< Shifted mode THREE for PDM_CFG0 */
#define PDM_CFG0_FIFODVL_FOUR                  (_PDM_CFG0_FIFODVL_FOUR << 12)              /**< Shifted mode FOUR for PDM_CFG0 */
#define PDM_CFG0_STEREOMODECH01                (0x1UL << 16)                               /**< Stereo mode CH01 */
#define _PDM_CFG0_STEREOMODECH01_SHIFT         16                                          /**< Shift value for PDM_STEREOMODECH01 */
#define _PDM_CFG0_STEREOMODECH01_MASK          0x10000UL                                   /**< Bit mask for PDM_STEREOMODECH01 */
#define _PDM_CFG0_STEREOMODECH01_DEFAULT       0x00000000UL                                /**< Mode DEFAULT for PDM_CFG0 */
#define _PDM_CFG0_STEREOMODECH01_DISABLE       0x00000000UL                                /**< Mode DISABLE for PDM_CFG0 */
#define _PDM_CFG0_STEREOMODECH01_CH01ENABLE    0x00000001UL                                /**< Mode CH01ENABLE for PDM_CFG0 */
#define PDM_CFG0_STEREOMODECH01_DEFAULT        (_PDM_CFG0_STEREOMODECH01_DEFAULT << 16)    /**< Shifted mode DEFAULT for PDM_CFG0 */
#define PDM_CFG0_STEREOMODECH01_DISABLE        (_PDM_CFG0_STEREOMODECH01_DISABLE << 16)    /**< Shifted mode DISABLE for PDM_CFG0 */
#define PDM_CFG0_STEREOMODECH01_CH01ENABLE     (_PDM_CFG0_STEREOMODECH01_CH01ENABLE << 16) /**< Shifted mode CH01ENABLE for PDM_CFG0 */
#define PDM_CFG0_STEREOMODECH23                (0x1UL << 17)                               /**< Stereo mode CH23 */
#define _PDM_CFG0_STEREOMODECH23_SHIFT         17                                          /**< Shift value for PDM_STEREOMODECH23 */
#define _PDM_CFG0_STEREOMODECH23_MASK          0x20000UL                                   /**< Bit mask for PDM_STEREOMODECH23 */
#define _PDM_CFG0_STEREOMODECH23_DEFAULT       0x00000000UL                                /**< Mode DEFAULT for PDM_CFG0 */
#define _PDM_CFG0_STEREOMODECH23_DISABLE       0x00000000UL                                /**< Mode DISABLE for PDM_CFG0 */
#define _PDM_CFG0_STEREOMODECH23_CH23ENABLE    0x00000001UL                                /**< Mode CH23ENABLE for PDM_CFG0 */
#define PDM_CFG0_STEREOMODECH23_DEFAULT        (_PDM_CFG0_STEREOMODECH23_DEFAULT << 17)    /**< Shifted mode DEFAULT for PDM_CFG0 */
#define PDM_CFG0_STEREOMODECH23_DISABLE        (_PDM_CFG0_STEREOMODECH23_DISABLE << 17)    /**< Shifted mode DISABLE for PDM_CFG0 */
#define PDM_CFG0_STEREOMODECH23_CH23ENABLE     (_PDM_CFG0_STEREOMODECH23_CH23ENABLE << 17) /**< Shifted mode CH23ENABLE for PDM_CFG0 */
#define PDM_CFG0_CH0CLKPOL                     (0x1UL << 24)                               /**< CH0 CLK Polarity */
#define _PDM_CFG0_CH0CLKPOL_SHIFT              24                                          /**< Shift value for PDM_CH0CLKPOL */
#define _PDM_CFG0_CH0CLKPOL_MASK               0x1000000UL                                 /**< Bit mask for PDM_CH0CLKPOL */
#define _PDM_CFG0_CH0CLKPOL_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for PDM_CFG0 */
#define _PDM_CFG0_CH0CLKPOL_NORMAL             0x00000000UL                                /**< Mode NORMAL for PDM_CFG0 */
#define _PDM_CFG0_CH0CLKPOL_INVERT             0x00000001UL                                /**< Mode INVERT for PDM_CFG0 */
#define PDM_CFG0_CH0CLKPOL_DEFAULT             (_PDM_CFG0_CH0CLKPOL_DEFAULT << 24)         /**< Shifted mode DEFAULT for PDM_CFG0 */
#define PDM_CFG0_CH0CLKPOL_NORMAL              (_PDM_CFG0_CH0CLKPOL_NORMAL << 24)          /**< Shifted mode NORMAL for PDM_CFG0 */
#define PDM_CFG0_CH0CLKPOL_INVERT              (_PDM_CFG0_CH0CLKPOL_INVERT << 24)          /**< Shifted mode INVERT for PDM_CFG0 */
#define PDM_CFG0_CH1CLKPOL                     (0x1UL << 25)                               /**< CH1 CLK Polarity */
#define _PDM_CFG0_CH1CLKPOL_SHIFT              25                                          /**< Shift value for PDM_CH1CLKPOL */
#define _PDM_CFG0_CH1CLKPOL_MASK               0x2000000UL                                 /**< Bit mask for PDM_CH1CLKPOL */
#define _PDM_CFG0_CH1CLKPOL_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for PDM_CFG0 */
#define _PDM_CFG0_CH1CLKPOL_NORMAL             0x00000000UL                                /**< Mode NORMAL for PDM_CFG0 */
#define _PDM_CFG0_CH1CLKPOL_INVERT             0x00000001UL                                /**< Mode INVERT for PDM_CFG0 */
#define PDM_CFG0_CH1CLKPOL_DEFAULT             (_PDM_CFG0_CH1CLKPOL_DEFAULT << 25)         /**< Shifted mode DEFAULT for PDM_CFG0 */
#define PDM_CFG0_CH1CLKPOL_NORMAL              (_PDM_CFG0_CH1CLKPOL_NORMAL << 25)          /**< Shifted mode NORMAL for PDM_CFG0 */
#define PDM_CFG0_CH1CLKPOL_INVERT              (_PDM_CFG0_CH1CLKPOL_INVERT << 25)          /**< Shifted mode INVERT for PDM_CFG0 */
#define PDM_CFG0_CH2CLKPOL                     (0x1UL << 26)                               /**< CH2 CLK Polarity */
#define _PDM_CFG0_CH2CLKPOL_SHIFT              26                                          /**< Shift value for PDM_CH2CLKPOL */
#define _PDM_CFG0_CH2CLKPOL_MASK               0x4000000UL                                 /**< Bit mask for PDM_CH2CLKPOL */
#define _PDM_CFG0_CH2CLKPOL_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for PDM_CFG0 */
#define _PDM_CFG0_CH2CLKPOL_NORMAL             0x00000000UL                                /**< Mode NORMAL for PDM_CFG0 */
#define _PDM_CFG0_CH2CLKPOL_INVERT             0x00000001UL                                /**< Mode INVERT for PDM_CFG0 */
#define PDM_CFG0_CH2CLKPOL_DEFAULT             (_PDM_CFG0_CH2CLKPOL_DEFAULT << 26)         /**< Shifted mode DEFAULT for PDM_CFG0 */
#define PDM_CFG0_CH2CLKPOL_NORMAL              (_PDM_CFG0_CH2CLKPOL_NORMAL << 26)          /**< Shifted mode NORMAL for PDM_CFG0 */
#define PDM_CFG0_CH2CLKPOL_INVERT              (_PDM_CFG0_CH2CLKPOL_INVERT << 26)          /**< Shifted mode INVERT for PDM_CFG0 */
#define PDM_CFG0_CH3CLKPOL                     (0x1UL << 27)                               /**< CH3 CLK Polarity */
#define _PDM_CFG0_CH3CLKPOL_SHIFT              27                                          /**< Shift value for PDM_CH3CLKPOL */
#define _PDM_CFG0_CH3CLKPOL_MASK               0x8000000UL                                 /**< Bit mask for PDM_CH3CLKPOL */
#define _PDM_CFG0_CH3CLKPOL_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for PDM_CFG0 */
#define _PDM_CFG0_CH3CLKPOL_NORMAL             0x00000000UL                                /**< Mode NORMAL for PDM_CFG0 */
#define _PDM_CFG0_CH3CLKPOL_INVERT             0x00000001UL                                /**< Mode INVERT for PDM_CFG0 */
#define PDM_CFG0_CH3CLKPOL_DEFAULT             (_PDM_CFG0_CH3CLKPOL_DEFAULT << 27)         /**< Shifted mode DEFAULT for PDM_CFG0 */
#define PDM_CFG0_CH3CLKPOL_NORMAL              (_PDM_CFG0_CH3CLKPOL_NORMAL << 27)          /**< Shifted mode NORMAL for PDM_CFG0 */
#define PDM_CFG0_CH3CLKPOL_INVERT              (_PDM_CFG0_CH3CLKPOL_INVERT << 27)          /**< Shifted mode INVERT for PDM_CFG0 */

/* Bit fields for PDM CFG1 */
#define _PDM_CFG1_RESETVALUE                   0x00000000UL                   /**< Default value for PDM_CFG1 */
#define _PDM_CFG1_MASK                         0x000003FFUL                   /**< Mask for PDM_CFG1 */
#define _PDM_CFG1_PRESC_SHIFT                  0                              /**< Shift value for PDM_PRESC */
#define _PDM_CFG1_PRESC_MASK                   0x3FFUL                        /**< Bit mask for PDM_PRESC */
#define _PDM_CFG1_PRESC_DEFAULT                0x00000000UL                   /**< Mode DEFAULT for PDM_CFG1 */
#define PDM_CFG1_PRESC_DEFAULT                 (_PDM_CFG1_PRESC_DEFAULT << 0) /**< Shifted mode DEFAULT for PDM_CFG1 */

/* Bit fields for PDM RXDATA */
#define _PDM_RXDATA_RESETVALUE                 0x00000000UL                      /**< Default value for PDM_RXDATA */
#define _PDM_RXDATA_MASK                       0xFFFFFFFFUL                      /**< Mask for PDM_RXDATA */
#define _PDM_RXDATA_RXDATA_SHIFT               0                                 /**< Shift value for PDM_RXDATA */
#define _PDM_RXDATA_RXDATA_MASK                0xFFFFFFFFUL                      /**< Bit mask for PDM_RXDATA */
#define _PDM_RXDATA_RXDATA_DEFAULT             0x00000000UL                      /**< Mode DEFAULT for PDM_RXDATA */
#define PDM_RXDATA_RXDATA_DEFAULT              (_PDM_RXDATA_RXDATA_DEFAULT << 0) /**< Shifted mode DEFAULT for PDM_RXDATA */

