RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_pdm.h
/* Bit fields for PDM IF */
#define _PDM_IF_RESETVALUE                     0x00000000UL               /**< Default value for PDM_IF */
#define _PDM_IF_MASK                           0x0000000FUL               /**< Mask for PDM_IF */
#define PDM_IF_DV                              (0x1UL << 0)               /**< Data Valid Interrupt Flag */
#define _PDM_IF_DV_SHIFT                       0                          /**< Shift value for PDM_DV */
#define _PDM_IF_DV_MASK                        0x1UL                      /**< Bit mask for PDM_DV */
#define _PDM_IF_DV_DEFAULT                     0x00000000UL               /**< Mode DEFAULT for PDM_IF */
#define PDM_IF_DV_DEFAULT                      (_PDM_IF_DV_DEFAULT << 0)  /**< Shifted mode DEFAULT for PDM_IF */
#define PDM_IF_DVL                             (0x1UL << 1)               /**< Data Valid Level Interrupt Flag */
#define _PDM_IF_DVL_SHIFT                      1                          /**< Shift value for PDM_DVL */
#define _PDM_IF_DVL_MASK                       0x2UL                      /**< Bit mask for PDM_DVL */
#define _PDM_IF_DVL_DEFAULT                    0x00000000UL               /**< Mode DEFAULT for PDM_IF */
#define PDM_IF_DVL_DEFAULT                     (_PDM_IF_DVL_DEFAULT << 1) /**< Shifted mode DEFAULT for PDM_IF */
#define PDM_IF_OF                              (0x1UL << 2)               /**< FIFO Overflow Interrupt Flag */
#define _PDM_IF_OF_SHIFT                       2                          /**< Shift value for PDM_OF */
#define _PDM_IF_OF_MASK                        0x4UL                      /**< Bit mask for PDM_OF */
#define _PDM_IF_OF_DEFAULT                     0x00000000UL               /**< Mode DEFAULT for PDM_IF */
#define PDM_IF_OF_DEFAULT                      (_PDM_IF_OF_DEFAULT << 2)  /**< Shifted mode DEFAULT for PDM_IF */
#define PDM_IF_UF                              (0x1UL << 3)               /**< FIFO Undeflow Interrupt Flag */
#define _PDM_IF_UF_SHIFT                       3                          /**< Shift value for PDM_UF */
#define _PDM_IF_UF_MASK                        0x8UL                      /**< Bit mask for PDM_UF */
#define _PDM_IF_UF_DEFAULT                     0x00000000UL               /**< Mode DEFAULT for PDM_IF */
#define PDM_IF_UF_DEFAULT                      (_PDM_IF_UF_DEFAULT << 3)  /**< Shifted mode DEFAULT for PDM_IF */

/* Bit fields for PDM IFS */
#define _PDM_IFS_RESETVALUE                    0x00000000UL                /**< Default value for PDM_IFS */
#define _PDM_IFS_MASK                          0x0000000FUL                /**< Mask for PDM_IFS */
#define PDM_IFS_DV                             (0x1UL << 0)                /**< Set DV Interrupt Flag */
#define _PDM_IFS_DV_SHIFT                      0                           /**< Shift value for PDM_DV */
#define _PDM_IFS_DV_MASK                       0x1UL                       /**< Bit mask for PDM_DV */
#define _PDM_IFS_DV_DEFAULT                    0x00000000UL                /**< Mode DEFAULT for PDM_IFS */
#define PDM_IFS_DV_DEFAULT                     (_PDM_IFS_DV_DEFAULT << 0)  /**< Shifted mode DEFAULT for PDM_IFS */
#define PDM_IFS_DVL                            (0x1UL << 1)                /**< Set DVL Interrupt Flag */
#define _PDM_IFS_DVL_SHIFT                     1                           /**< Shift value for PDM_DVL */
#define _PDM_IFS_DVL_MASK                      0x2UL                       /**< Bit mask for PDM_DVL */
#define _PDM_IFS_DVL_DEFAULT                   0x00000000UL                /**< Mode DEFAULT for PDM_IFS */
#define PDM_IFS_DVL_DEFAULT                    (_PDM_IFS_DVL_DEFAULT << 1) /**< Shifted mode DEFAULT for PDM_IFS */
#define PDM_IFS_OF                             (0x1UL << 2)                /**< Set OF Interrupt Flag */
#define _PDM_IFS_OF_SHIFT                      2                           /**< Shift value for PDM_OF */
#define _PDM_IFS_OF_MASK                       0x4UL                       /**< Bit mask for PDM_OF */
#define _PDM_IFS_OF_DEFAULT                    0x00000000UL                /**< Mode DEFAULT for PDM_IFS */
#define PDM_IFS_OF_DEFAULT                     (_PDM_IFS_OF_DEFAULT << 2)  /**< Shifted mode DEFAULT for PDM_IFS */
#define PDM_IFS_UF                             (0x1UL << 3)                /**< Set UF Interrupt Flag */
#define _PDM_IFS_UF_SHIFT                      3                           /**< Shift value for PDM_UF */
#define _PDM_IFS_UF_MASK                       0x8UL                       /**< Bit mask for PDM_UF */
#define _PDM_IFS_UF_DEFAULT                    0x00000000UL                /**< Mode DEFAULT for PDM_IFS */
#define PDM_IFS_UF_DEFAULT                     (_PDM_IFS_UF_DEFAULT << 3)  /**< Shifted mode DEFAULT for PDM_IFS */

/* Bit fields for PDM IFC */
#define _PDM_IFC_RESETVALUE                    0x00000000UL                /**< Default value for PDM_IFC */
#define _PDM_IFC_MASK                          0x0000000FUL                /**< Mask for PDM_IFC */
#define PDM_IFC_DV                             (0x1UL << 0)                /**< Clear DV Interrupt Flag */
#define _PDM_IFC_DV_SHIFT                      0                           /**< Shift value for PDM_DV */
#define _PDM_IFC_DV_MASK                       0x1UL                       /**< Bit mask for PDM_DV */
#define _PDM_IFC_DV_DEFAULT                    0x00000000UL                /**< Mode DEFAULT for PDM_IFC */
#define PDM_IFC_DV_DEFAULT                     (_PDM_IFC_DV_DEFAULT << 0)  /**< Shifted mode DEFAULT for PDM_IFC */
#define PDM_IFC_DVL                            (0x1UL << 1)                /**< Clear DVL Interrupt Flag */
#define _PDM_IFC_DVL_SHIFT                     1                           /**< Shift value for PDM_DVL */
#define _PDM_IFC_DVL_MASK                      0x2UL                       /**< Bit mask for PDM_DVL */
#define _PDM_IFC_DVL_DEFAULT                   0x00000000UL                /**< Mode DEFAULT for PDM_IFC */
#define PDM_IFC_DVL_DEFAULT                    (_PDM_IFC_DVL_DEFAULT << 1) /**< Shifted mode DEFAULT for PDM_IFC */
#define PDM_IFC_OF                             (0x1UL << 2)                /**< Clear OF Interrupt Flag */
#define _PDM_IFC_OF_SHIFT                      2                           /**< Shift value for PDM_OF */
#define _PDM_IFC_OF_MASK                       0x4UL                       /**< Bit mask for PDM_OF */
#define _PDM_IFC_OF_DEFAULT                    0x00000000UL                /**< Mode DEFAULT for PDM_IFC */
#define PDM_IFC_OF_DEFAULT                     (_PDM_IFC_OF_DEFAULT << 2)  /**< Shifted mode DEFAULT for PDM_IFC */
#define PDM_IFC_UF                             (0x1UL << 3)                /**< Clear UF Interrupt Flag */
#define _PDM_IFC_UF_SHIFT                      3                           /**< Shift value for PDM_UF */
#define _PDM_IFC_UF_MASK                       0x8UL                       /**< Bit mask for PDM_UF */
#define _PDM_IFC_UF_DEFAULT                    0x00000000UL                /**< Mode DEFAULT for PDM_IFC */
#define PDM_IFC_UF_DEFAULT                     (_PDM_IFC_UF_DEFAULT << 3)  /**< Shifted mode DEFAULT for PDM_IFC */

