RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_pdm.h
/* Bit fields for PDM IEN */
#define _PDM_IEN_RESETVALUE                    0x00000000UL                /**< Default value for PDM_IEN */
#define _PDM_IEN_MASK                          0x0000000FUL                /**< Mask for PDM_IEN */
#define PDM_IEN_DV                             (0x1UL << 0)                /**< DV Interrupt Enable */
#define _PDM_IEN_DV_SHIFT                      0                           /**< Shift value for PDM_DV */
#define _PDM_IEN_DV_MASK                       0x1UL                       /**< Bit mask for PDM_DV */
#define _PDM_IEN_DV_DEFAULT                    0x00000000UL                /**< Mode DEFAULT for PDM_IEN */
#define PDM_IEN_DV_DEFAULT                     (_PDM_IEN_DV_DEFAULT << 0)  /**< Shifted mode DEFAULT for PDM_IEN */
#define PDM_IEN_DVL                            (0x1UL << 1)                /**< DVL Interrupt Enable */
#define _PDM_IEN_DVL_SHIFT                     1                           /**< Shift value for PDM_DVL */
#define _PDM_IEN_DVL_MASK                      0x2UL                       /**< Bit mask for PDM_DVL */
#define _PDM_IEN_DVL_DEFAULT                   0x00000000UL                /**< Mode DEFAULT for PDM_IEN */
#define PDM_IEN_DVL_DEFAULT                    (_PDM_IEN_DVL_DEFAULT << 1) /**< Shifted mode DEFAULT for PDM_IEN */
#define PDM_IEN_OF                             (0x1UL << 2)                /**< OF Interrupt Enable */
#define _PDM_IEN_OF_SHIFT                      2                           /**< Shift value for PDM_OF */
#define _PDM_IEN_OF_MASK                       0x4UL                       /**< Bit mask for PDM_OF */
#define _PDM_IEN_OF_DEFAULT                    0x00000000UL                /**< Mode DEFAULT for PDM_IEN */
#define PDM_IEN_OF_DEFAULT                     (_PDM_IEN_OF_DEFAULT << 2)  /**< Shifted mode DEFAULT for PDM_IEN */
#define PDM_IEN_UF                             (0x1UL << 3)                /**< UF Interrupt Enable */
#define _PDM_IEN_UF_SHIFT                      3                           /**< Shift value for PDM_UF */
#define _PDM_IEN_UF_MASK                       0x8UL                       /**< Bit mask for PDM_UF */
#define _PDM_IEN_UF_DEFAULT                    0x00000000UL                /**< Mode DEFAULT for PDM_IEN */
#define PDM_IEN_UF_DEFAULT                     (_PDM_IEN_UF_DEFAULT << 3)  /**< Shifted mode DEFAULT for PDM_IEN */

/* Bit fields for PDM ROUTEPEN */
#define _PDM_ROUTEPEN_RESETVALUE               0x00000000UL                         /**< Default value for PDM_ROUTEPEN */
#define _PDM_ROUTEPEN_MASK                     0x0000010FUL                         /**< Mask for PDM_ROUTEPEN */
#define PDM_ROUTEPEN_DAT0PEN                   (0x1UL << 0)                         /**< DAT0 I/O Enable */
#define _PDM_ROUTEPEN_DAT0PEN_SHIFT            0                                    /**< Shift value for PDM_DAT0PEN */
#define _PDM_ROUTEPEN_DAT0PEN_MASK             0x1UL                                /**< Bit mask for PDM_DAT0PEN */
#define _PDM_ROUTEPEN_DAT0PEN_DEFAULT          0x00000000UL                         /**< Mode DEFAULT for PDM_ROUTEPEN */
#define PDM_ROUTEPEN_DAT0PEN_DEFAULT           (_PDM_ROUTEPEN_DAT0PEN_DEFAULT << 0) /**< Shifted mode DEFAULT for PDM_ROUTEPEN */
#define PDM_ROUTEPEN_DAT1PEN                   (0x1UL << 1)                         /**< DAT1 I/O Enable */
#define _PDM_ROUTEPEN_DAT1PEN_SHIFT            1                                    /**< Shift value for PDM_DAT1PEN */
#define _PDM_ROUTEPEN_DAT1PEN_MASK             0x2UL                                /**< Bit mask for PDM_DAT1PEN */
#define _PDM_ROUTEPEN_DAT1PEN_DEFAULT          0x00000000UL                         /**< Mode DEFAULT for PDM_ROUTEPEN */
#define PDM_ROUTEPEN_DAT1PEN_DEFAULT           (_PDM_ROUTEPEN_DAT1PEN_DEFAULT << 1) /**< Shifted mode DEFAULT for PDM_ROUTEPEN */
#define PDM_ROUTEPEN_DAT2PEN                   (0x1UL << 2)                         /**< DAT2 I/O Enable */
#define _PDM_ROUTEPEN_DAT2PEN_SHIFT            2                                    /**< Shift value for PDM_DAT2PEN */
#define _PDM_ROUTEPEN_DAT2PEN_MASK             0x4UL                                /**< Bit mask for PDM_DAT2PEN */
#define _PDM_ROUTEPEN_DAT2PEN_DEFAULT          0x00000000UL                         /**< Mode DEFAULT for PDM_ROUTEPEN */
#define PDM_ROUTEPEN_DAT2PEN_DEFAULT           (_PDM_ROUTEPEN_DAT2PEN_DEFAULT << 2) /**< Shifted mode DEFAULT for PDM_ROUTEPEN */
#define PDM_ROUTEPEN_DAT3PEN                   (0x1UL << 3)                         /**< DAT3 I/O Enable */
#define _PDM_ROUTEPEN_DAT3PEN_SHIFT            3                                    /**< Shift value for PDM_DAT3PEN */
#define _PDM_ROUTEPEN_DAT3PEN_MASK             0x8UL                                /**< Bit mask for PDM_DAT3PEN */
#define _PDM_ROUTEPEN_DAT3PEN_DEFAULT          0x00000000UL                         /**< Mode DEFAULT for PDM_ROUTEPEN */
#define PDM_ROUTEPEN_DAT3PEN_DEFAULT           (_PDM_ROUTEPEN_DAT3PEN_DEFAULT << 3) /**< Shifted mode DEFAULT for PDM_ROUTEPEN */
#define PDM_ROUTEPEN_CLKPEN                    (0x1UL << 8)                         /**< CLK I/O Enable */
#define _PDM_ROUTEPEN_CLKPEN_SHIFT             8                                    /**< Shift value for PDM_CLKPEN */
#define _PDM_ROUTEPEN_CLKPEN_MASK              0x100UL                              /**< Bit mask for PDM_CLKPEN */
#define _PDM_ROUTEPEN_CLKPEN_DEFAULT           0x00000000UL                         /**< Mode DEFAULT for PDM_ROUTEPEN */
#define PDM_ROUTEPEN_CLKPEN_DEFAULT            (_PDM_ROUTEPEN_CLKPEN_DEFAULT << 8)  /**< Shifted mode DEFAULT for PDM_ROUTEPEN */

/* Bit fields for PDM ROUTELOC0 */
#define _PDM_ROUTELOC0_RESETVALUE              0x00000000UL                           /**< Default value for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_MASK                    0x07070707UL                           /**< Mask for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT0LOC_SHIFT           0                                      /**< Shift value for PDM_DAT0LOC */
#define _PDM_ROUTELOC0_DAT0LOC_MASK            0x7UL                                  /**< Bit mask for PDM_DAT0LOC */
#define _PDM_ROUTELOC0_DAT0LOC_LOC0            0x00000000UL                           /**< Mode LOC0 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT0LOC_DEFAULT         0x00000000UL                           /**< Mode DEFAULT for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT0LOC_LOC1            0x00000001UL                           /**< Mode LOC1 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT0LOC_LOC2            0x00000002UL                           /**< Mode LOC2 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT0LOC_LOC3            0x00000003UL                           /**< Mode LOC3 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT0LOC_LOC4            0x00000004UL                           /**< Mode LOC4 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT0LOC_LOC0             (_PDM_ROUTELOC0_DAT0LOC_LOC0 << 0)     /**< Shifted mode LOC0 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT0LOC_DEFAULT          (_PDM_ROUTELOC0_DAT0LOC_DEFAULT << 0)  /**< Shifted mode DEFAULT for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT0LOC_LOC1             (_PDM_ROUTELOC0_DAT0LOC_LOC1 << 0)     /**< Shifted mode LOC1 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT0LOC_LOC2             (_PDM_ROUTELOC0_DAT0LOC_LOC2 << 0)     /**< Shifted mode LOC2 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT0LOC_LOC3             (_PDM_ROUTELOC0_DAT0LOC_LOC3 << 0)     /**< Shifted mode LOC3 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT0LOC_LOC4             (_PDM_ROUTELOC0_DAT0LOC_LOC4 << 0)     /**< Shifted mode LOC4 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT1LOC_SHIFT           8                                      /**< Shift value for PDM_DAT1LOC */
#define _PDM_ROUTELOC0_DAT1LOC_MASK            0x700UL                                /**< Bit mask for PDM_DAT1LOC */
#define _PDM_ROUTELOC0_DAT1LOC_LOC0            0x00000000UL                           /**< Mode LOC0 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT1LOC_DEFAULT         0x00000000UL                           /**< Mode DEFAULT for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT1LOC_LOC1            0x00000001UL                           /**< Mode LOC1 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT1LOC_LOC2            0x00000002UL                           /**< Mode LOC2 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT1LOC_LOC3            0x00000003UL                           /**< Mode LOC3 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT1LOC_LOC4            0x00000004UL                           /**< Mode LOC4 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT1LOC_LOC0             (_PDM_ROUTELOC0_DAT1LOC_LOC0 << 8)     /**< Shifted mode LOC0 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT1LOC_DEFAULT          (_PDM_ROUTELOC0_DAT1LOC_DEFAULT << 8)  /**< Shifted mode DEFAULT for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT1LOC_LOC1             (_PDM_ROUTELOC0_DAT1LOC_LOC1 << 8)     /**< Shifted mode LOC1 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT1LOC_LOC2             (_PDM_ROUTELOC0_DAT1LOC_LOC2 << 8)     /**< Shifted mode LOC2 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT1LOC_LOC3             (_PDM_ROUTELOC0_DAT1LOC_LOC3 << 8)     /**< Shifted mode LOC3 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT1LOC_LOC4             (_PDM_ROUTELOC0_DAT1LOC_LOC4 << 8)     /**< Shifted mode LOC4 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT2LOC_SHIFT           16                                     /**< Shift value for PDM_DAT2LOC */
#define _PDM_ROUTELOC0_DAT2LOC_MASK            0x70000UL                              /**< Bit mask for PDM_DAT2LOC */
#define _PDM_ROUTELOC0_DAT2LOC_LOC0            0x00000000UL                           /**< Mode LOC0 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT2LOC_DEFAULT         0x00000000UL                           /**< Mode DEFAULT for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT2LOC_LOC1            0x00000001UL                           /**< Mode LOC1 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT2LOC_LOC2            0x00000002UL                           /**< Mode LOC2 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT2LOC_LOC3            0x00000003UL                           /**< Mode LOC3 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT2LOC_LOC4            0x00000004UL                           /**< Mode LOC4 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT2LOC_LOC0             (_PDM_ROUTELOC0_DAT2LOC_LOC0 << 16)    /**< Shifted mode LOC0 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT2LOC_DEFAULT          (_PDM_ROUTELOC0_DAT2LOC_DEFAULT << 16) /**< Shifted mode DEFAULT for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT2LOC_LOC1             (_PDM_ROUTELOC0_DAT2LOC_LOC1 << 16)    /**< Shifted mode LOC1 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT2LOC_LOC2             (_PDM_ROUTELOC0_DAT2LOC_LOC2 << 16)    /**< Shifted mode LOC2 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT2LOC_LOC3             (_PDM_ROUTELOC0_DAT2LOC_LOC3 << 16)    /**< Shifted mode LOC3 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT2LOC_LOC4             (_PDM_ROUTELOC0_DAT2LOC_LOC4 << 16)    /**< Shifted mode LOC4 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT3LOC_SHIFT           24                                     /**< Shift value for PDM_DAT3LOC */
#define _PDM_ROUTELOC0_DAT3LOC_MASK            0x7000000UL                            /**< Bit mask for PDM_DAT3LOC */
#define _PDM_ROUTELOC0_DAT3LOC_LOC0            0x00000000UL                           /**< Mode LOC0 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT3LOC_DEFAULT         0x00000000UL                           /**< Mode DEFAULT for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT3LOC_LOC1            0x00000001UL                           /**< Mode LOC1 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT3LOC_LOC2            0x00000002UL                           /**< Mode LOC2 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT3LOC_LOC3            0x00000003UL                           /**< Mode LOC3 for PDM_ROUTELOC0 */
#define _PDM_ROUTELOC0_DAT3LOC_LOC4            0x00000004UL                           /**< Mode LOC4 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT3LOC_LOC0             (_PDM_ROUTELOC0_DAT3LOC_LOC0 << 24)    /**< Shifted mode LOC0 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT3LOC_DEFAULT          (_PDM_ROUTELOC0_DAT3LOC_DEFAULT << 24) /**< Shifted mode DEFAULT for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT3LOC_LOC1             (_PDM_ROUTELOC0_DAT3LOC_LOC1 << 24)    /**< Shifted mode LOC1 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT3LOC_LOC2             (_PDM_ROUTELOC0_DAT3LOC_LOC2 << 24)    /**< Shifted mode LOC2 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT3LOC_LOC3             (_PDM_ROUTELOC0_DAT3LOC_LOC3 << 24)    /**< Shifted mode LOC3 for PDM_ROUTELOC0 */
#define PDM_ROUTELOC0_DAT3LOC_LOC4             (_PDM_ROUTELOC0_DAT3LOC_LOC4 << 24)    /**< Shifted mode LOC4 for PDM_ROUTELOC0 */

/* Bit fields for PDM ROUTELOC1 */
#define _PDM_ROUTELOC1_RESETVALUE              0x00000000UL                         /**< Default value for PDM_ROUTELOC1 */
#define _PDM_ROUTELOC1_MASK                    0x00000007UL                         /**< Mask for PDM_ROUTELOC1 */
#define _PDM_ROUTELOC1_CLKLOC_SHIFT            0                                    /**< Shift value for PDM_CLKLOC */
#define _PDM_ROUTELOC1_CLKLOC_MASK             0x7UL                                /**< Bit mask for PDM_CLKLOC */
#define _PDM_ROUTELOC1_CLKLOC_LOC0             0x00000000UL                         /**< Mode LOC0 for PDM_ROUTELOC1 */
#define _PDM_ROUTELOC1_CLKLOC_DEFAULT          0x00000000UL                         /**< Mode DEFAULT for PDM_ROUTELOC1 */
#define _PDM_ROUTELOC1_CLKLOC_LOC1             0x00000001UL                         /**< Mode LOC1 for PDM_ROUTELOC1 */
#define _PDM_ROUTELOC1_CLKLOC_LOC2             0x00000002UL                         /**< Mode LOC2 for PDM_ROUTELOC1 */
#define _PDM_ROUTELOC1_CLKLOC_LOC3             0x00000003UL                         /**< Mode LOC3 for PDM_ROUTELOC1 */
#define _PDM_ROUTELOC1_CLKLOC_LOC4             0x00000004UL                         /**< Mode LOC4 for PDM_ROUTELOC1 */
#define PDM_ROUTELOC1_CLKLOC_LOC0              (_PDM_ROUTELOC1_CLKLOC_LOC0 << 0)    /**< Shifted mode LOC0 for PDM_ROUTELOC1 */
#define PDM_ROUTELOC1_CLKLOC_DEFAULT           (_PDM_ROUTELOC1_CLKLOC_DEFAULT << 0) /**< Shifted mode DEFAULT for PDM_ROUTELOC1 */
#define PDM_ROUTELOC1_CLKLOC_LOC1              (_PDM_ROUTELOC1_CLKLOC_LOC1 << 0)    /**< Shifted mode LOC1 for PDM_ROUTELOC1 */
#define PDM_ROUTELOC1_CLKLOC_LOC2              (_PDM_ROUTELOC1_CLKLOC_LOC2 << 0)    /**< Shifted mode LOC2 for PDM_ROUTELOC1 */
#define PDM_ROUTELOC1_CLKLOC_LOC3              (_PDM_ROUTELOC1_CLKLOC_LOC3 << 0)    /**< Shifted mode LOC3 for PDM_ROUTELOC1 */
#define PDM_ROUTELOC1_CLKLOC_LOC4              (_PDM_ROUTELOC1_CLKLOC_LOC4 << 0)    /**< Shifted mode LOC4 for PDM_ROUTELOC1 */

/* Bit fields for PDM SYNCBUSY */
#define _PDM_SYNCBUSY_RESETVALUE               0x00000000UL                              /**< Default value for PDM_SYNCBUSY */
#define _PDM_SYNCBUSY_MASK                     0x0000050FUL                              /**< Mask for PDM_SYNCBUSY */
#define PDM_SYNCBUSY_STARTBUSY                 (0x1UL << 0)                              /**< START sync busy */
#define _PDM_SYNCBUSY_STARTBUSY_SHIFT          0                                         /**< Shift value for PDM_STARTBUSY */
#define _PDM_SYNCBUSY_STARTBUSY_MASK           0x1UL                                     /**< Bit mask for PDM_STARTBUSY */
#define _PDM_SYNCBUSY_STARTBUSY_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for PDM_SYNCBUSY */
#define PDM_SYNCBUSY_STARTBUSY_DEFAULT         (_PDM_SYNCBUSY_STARTBUSY_DEFAULT << 0)    /**< Shifted mode DEFAULT for PDM_SYNCBUSY */
#define PDM_SYNCBUSY_STOPBUSY                  (0x1UL << 1)                              /**< STOP sync busy */
#define _PDM_SYNCBUSY_STOPBUSY_SHIFT           1                                         /**< Shift value for PDM_STOPBUSY */
#define _PDM_SYNCBUSY_STOPBUSY_MASK            0x2UL                                     /**< Bit mask for PDM_STOPBUSY */
#define _PDM_SYNCBUSY_STOPBUSY_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for PDM_SYNCBUSY */
#define PDM_SYNCBUSY_STOPBUSY_DEFAULT          (_PDM_SYNCBUSY_STOPBUSY_DEFAULT << 1)     /**< Shifted mode DEFAULT for PDM_SYNCBUSY */
#define PDM_SYNCBUSY_CLEARBUSY                 (0x1UL << 2)                              /**< CLEAR sync busy */
#define _PDM_SYNCBUSY_CLEARBUSY_SHIFT          2                                         /**< Shift value for PDM_CLEARBUSY */
#define _PDM_SYNCBUSY_CLEARBUSY_MASK           0x4UL                                     /**< Bit mask for PDM_CLEARBUSY */
#define _PDM_SYNCBUSY_CLEARBUSY_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for PDM_SYNCBUSY */
#define PDM_SYNCBUSY_CLEARBUSY_DEFAULT         (_PDM_SYNCBUSY_CLEARBUSY_DEFAULT << 2)    /**< Shifted mode DEFAULT for PDM_SYNCBUSY */
#define PDM_SYNCBUSY_FIFOFLBUSY                (0x1UL << 3)                              /**< FIFO Flush Sync busy */
#define _PDM_SYNCBUSY_FIFOFLBUSY_SHIFT         3                                         /**< Shift value for PDM_FIFOFLBUSY */
#define _PDM_SYNCBUSY_FIFOFLBUSY_MASK          0x8UL                                     /**< Bit mask for PDM_FIFOFLBUSY */
#define _PDM_SYNCBUSY_FIFOFLBUSY_DEFAULT       0x00000000UL                              /**< Mode DEFAULT for PDM_SYNCBUSY */
#define PDM_SYNCBUSY_FIFOFLBUSY_DEFAULT        (_PDM_SYNCBUSY_FIFOFLBUSY_DEFAULT << 3)   /**< Shifted mode DEFAULT for PDM_SYNCBUSY */
#define PDM_SYNCBUSY_PRESCBUSY                 (0x1UL << 8)                              /**< PRESC Sync busy */
#define _PDM_SYNCBUSY_PRESCBUSY_SHIFT          8                                         /**< Shift value for PDM_PRESCBUSY */
#define _PDM_SYNCBUSY_PRESCBUSY_MASK           0x100UL                                   /**< Bit mask for PDM_PRESCBUSY */
#define _PDM_SYNCBUSY_PRESCBUSY_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for PDM_SYNCBUSY */
#define PDM_SYNCBUSY_PRESCBUSY_DEFAULT         (_PDM_SYNCBUSY_PRESCBUSY_DEFAULT << 8)    /**< Shifted mode DEFAULT for PDM_SYNCBUSY */
#define PDM_SYNCBUSY_CTRLREGBUSY               (0x1UL << 10)                             /**< CTRLREGBUSY busy */
#define _PDM_SYNCBUSY_CTRLREGBUSY_SHIFT        10                                        /**< Shift value for PDM_CTRLREGBUSY */
#define _PDM_SYNCBUSY_CTRLREGBUSY_MASK         0x400UL                                   /**< Bit mask for PDM_CTRLREGBUSY */
#define _PDM_SYNCBUSY_CTRLREGBUSY_DEFAULT      0x00000000UL                              /**< Mode DEFAULT for PDM_SYNCBUSY */
#define PDM_SYNCBUSY_CTRLREGBUSY_DEFAULT       (_PDM_SYNCBUSY_CTRLREGBUSY_DEFAULT << 10) /**< Shifted mode DEFAULT for PDM_SYNCBUSY */

/** @} */
/** @} End of group EFM32GG12B_PDM */
/** @} End of group Parts */
#ifdef __cplusplus
}
#endif

